Tekla Open API Reference for Tekla Structures 2025
PlacingDirectionAttributes Constructor
 Creates a new placing direction attributes instance. The positive and negative directions are set to false by default.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PlacingDirectionAttributes()
Public Sub New
See Also
Reference
PlacingDirectionAttributes Class
PlacingDirectionAttributes Overload
Tekla.Structures.Drawing Namespace